apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_touch_lowerhalf.h
/****************************************************************************
 * arch/xtensa/src/esp32s2/esp32s2_touch_lowerhalf.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32S2_ESP32S2_TOUCH_LOWERHALF_H
#define __ARCH_XTENSA_SRC_ESP32S2_ESP32S2_TOUCH_LOWERHALF_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>

#include "xtensa.h"

#include "hardware/esp32s2_rtc_io.h"
#include "soc/rtc_cntl_reg.h"
#include "hardware/esp32s2_touch.h"
#include "hardware/esp32s2_sens.h"

#include "esp32s2_rtc_gpio.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define TOUCH_LH_READ_RAW           0x0
#define TOUCH_LH_READ_BENCHMARK     0x2
#define TOUCH_LH_READ_SMOOTH        0x3
#define TOUCH_LH_TIMER_FORCE_DONE   0x3
#define TOUCH_LH_TIMER_DONE         0x0

#define setbits(a, bs)   modifyreg32(a, 0, bs)
#define resetbits(a, bs) modifyreg32(a, bs, 0)

/****************************************************************************
 * Public Data
 ****************************************************************************/

static const uint32_t rtcio_touch_reg[] =
{
  RTCIO_TOUCH_PAD0_REG,
  RTCIO_TOUCH_PAD1_REG,
  RTCIO_TOUCH_PAD2_REG,
  RTCIO_TOUCH_PAD3_REG,
  RTCIO_TOUCH_PAD4_REG,
  RTCIO_TOUCH_PAD5_REG,
  RTCIO_TOUCH_PAD6_REG,
  RTCIO_TOUCH_PAD7_REG,
  RTCIO_TOUCH_PAD8_REG,
  RTCIO_TOUCH_PAD9_REG,
  RTCIO_TOUCH_PAD10_REG,
  RTCIO_TOUCH_PAD11_REG,
  RTCIO_TOUCH_PAD12_REG,
  RTCIO_TOUCH_PAD13_REG,
  RTCIO_TOUCH_PAD14_REG
};

static const uint32_t sens_touch_thresh_reg[] =
{
  SENS_SAR_TOUCH_THRES1_REG,
  SENS_SAR_TOUCH_THRES2_REG,
  SENS_SAR_TOUCH_THRES3_REG,
  SENS_SAR_TOUCH_THRES4_REG,
  SENS_SAR_TOUCH_THRES5_REG,
  SENS_SAR_TOUCH_THRES6_REG,
  SENS_SAR_TOUCH_THRES7_REG,
  SENS_SAR_TOUCH_THRES8_REG,
  SENS_SAR_TOUCH_THRES9_REG,
  SENS_SAR_TOUCH_THRES10_REG,
  SENS_SAR_TOUCH_THRES11_REG,
  SENS_SAR_TOUCH_THRES12_REG,
  SENS_SAR_TOUCH_THRES13_REG,
  SENS_SAR_TOUCH_THRES14_REG
};

static const uint32_t sens_touch_status_reg[] =
{
  SENS_SAR_TOUCH_STATUS1_REG,
  SENS_SAR_TOUCH_STATUS2_REG,
  SENS_SAR_TOUCH_STATUS3_REG,
  SENS_SAR_TOUCH_STATUS4_REG,
  SENS_SAR_TOUCH_STATUS5_REG,
  SENS_SAR_TOUCH_STATUS6_REG,
  SENS_SAR_TOUCH_STATUS7_REG,
  SENS_SAR_TOUCH_STATUS8_REG,
  SENS_SAR_TOUCH_STATUS9_REG,
  SENS_SAR_TOUCH_STATUS10_REG,
  SENS_SAR_TOUCH_STATUS11_REG,
  SENS_SAR_TOUCH_STATUS12_REG,
  SENS_SAR_TOUCH_STATUS13_REG,
  SENS_SAR_TOUCH_STATUS14_REG
};

#ifndef __ASSEMBLY__

#undef EXTERN
#if defined(__cplusplus)
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

/****************************************************************************
 * Inline Functions
 ****************************************************************************/

/****************************************************************************
 * Name: touch_lh_set_meas_time
 *
 * Description:
 *   Set the measurement time for the touch sensors.
 *
 * Input Parameters:
 *   meas_time - The desired measurement time.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_set_meas_time(uint16_t meas_time)
{
  /* Touch sensor measure time = meas_cycle / 8Mhz */

  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL1_REG,
                RTC_CNTL_TOUCH_MEAS_NUM,
                meas_time);

  /* The waiting cycles (in 8MHz) between TOUCH_START and TOUCH_XPD */

  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_XPD_WAIT,
                TOUCH_MEASURE_WAIT_MAX);
}

/****************************************************************************
 * Name: touch_lh_get_meas_time
 *
 * Description:
 *   Get the measurement time for the touch sensors.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current measurement time.
 *
 ****************************************************************************/

static inline uint16_t touch_lh_get_meas_time(void)
{
  return REG_GET_FIELD(RTC_CNTL_TOUCH_CTRL1_REG, RTC_CNTL_TOUCH_MEAS_NUM);
}

/****************************************************************************
 * Name: touch_lh_set_sleep_time
 *
 * Description:
 *   Set the sleep time for the touch sensors.
 *
 * Input Parameters:
 *   sleep_time - The desired sleep time.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_set_sleep_time(uint16_t sleep_time)
{
  /* Touch sensor sleep cycle Time = sleep_cycle / RTC_SLOW_CLK
   * (can be 150k or 32k depending on the options)
   */

  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL1_REG,
                RTC_CNTL_TOUCH_SLEEP_CYCLES,
                sleep_time);
}

/****************************************************************************
 * Name: touch_lh_get_sleep_time
 *
 * Description:
 *   Get the sleep time for the touch sensors.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current sleep time.
 *
 ****************************************************************************/

