apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_touch_lowerhalf.h
  /* All touch pads have the same position for the data bits.
   * We can use any SENS_TOUCH_PADN_DATA.
   */

  return REG_GET_FIELD(sens_touch_status_reg[tp - 1],
                       SENS_TOUCH_PAD1_DATA);
}

/****************************************************************************
 * Name: touch_lh_meas_is_done
 *
 * Description:
 *   Check if measurement is done.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   True if yes, false if no.
 *
 ****************************************************************************/

static inline bool touch_lh_meas_is_done(void)
{
  return (bool) REG_GET_FIELD(SENS_SAR_TOUCH_CHN_ST_REG,
                              SENS_TOUCH_MEAS_DONE);
}

/****************************************************************************
 * Name: touch_lh_reset
 *
 * Description:
 *   Reset the whole of touch module.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_reset(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_RESET,
                false);

  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_RESET,
                true);

  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_RESET,
                false);
}

/****************************************************************************
 * Name: touch_lh_set_idle_channel_connect
 *
 * Description:
 *   Set connection type of touch channel in idle status.
 *   When a channel is in measurement mode, other initialized channels are in
 *   idle mode.
 *   The touch channel is generally adjacent to the trace, so the connection
 *   state of the idle channel affects the stability and sensitivity of the
 *   test channel.
 *   The `CONN_HIGHZ`(high resistance) setting increases the sensitivity of
 *   touch channels.
 *   The `CONN_GND`(grounding) setting increases the stability of touch
 *   channels.
 *
 * Input Parameters:
 *   type - The desired enum touch_conn_type_e value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void
  touch_lh_set_idle_channel_connect(enum touch_conn_type_e type)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_SCAN_CTRL_REG,
                RTC_CNTL_TOUCH_INACTIVE_CONNECTION,
                type);
}

/****************************************************************************
 * Name: touch_lh_get_idle_channel_connect
 *
 * Description:
 *   Get connection type of touch channel in idle status.
 *   When a channel is in measurement mode, other initialized channels are in
 *   idle mode.
 *   The touch channel is generally adjacent to the trace, so the connection
 *   state of the idle channel affects the stability and sensitivity of the
 *   test channel.
 *   The `CONN_HIGHZ`(high resistance) setting increases the sensitivity of
 *   touch channels.
 *   The `CONN_GND`(grounding) setting increases the stability of touch
 *   channels.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current enum touch_conn_type_e value.
 *
 ****************************************************************************/

static inline enum touch_conn_type_e
  touch_lh_get_idle_channel_connect(void)
{
  return (enum touch_conn_type_e)
    REG_GET_FIELD(RTC_CNTL_TOUCH_SCAN_CTRL_REG,
                  RTC_CNTL_TOUCH_INACTIVE_CONNECTION);
}

/****************************************************************************
 * Name: touch_lh_get_idle_channel_connect
 *
 * Description:
 *   Get the current measure channel.
 *   Touch sensor measurement is cyclic scan mode.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current touch channel.
 *
 ****************************************************************************/

static inline enum touch_pad_e touch_lh_get_current_meas_channel(void)
{
  return (enum touch_pad_e)
    REG_GET_FIELD(SENS_SAR_TOUCH_STATUS0_REG,
                  SENS_TOUCH_SCAN_CURR);
}

/****************************************************************************
 * Name: touch_lh_intr_enable
 *
 * Description:
 *   Enable touch sensor interrupt by bitmask.
 *
 * Input Parameters:
 *   int_mask - enum touch_pad_intr_mask_e interrupt type.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_intr_enable(enum touch_intr_mask_e int_mask)
{
  if (int_mask & TOUCH_INTR_MASK_DONE)
    {
      REG_SET_FIELD(RTC_CNTL_INT_ENA_REG,
                    RTC_CNTL_TOUCH_DONE_INT_ENA,
                    true);
    }

  if (int_mask & TOUCH_INTR_MASK_ACTIVE)
    {
      REG_SET_FIELD(RTC_CNTL_INT_ENA_REG,
                    RTC_CNTL_TOUCH_ACTIVE_INT_ENA,
                    true);
    }

  if (int_mask & TOUCH_INTR_MASK_INACTIVE)
    {
      REG_SET_FIELD(RTC_CNTL_INT_ENA_REG,
                    RTC_CNTL_TOUCH_INACTIVE_INT_ENA,
                    true);
    }

  if (int_mask & TOUCH_INTR_MASK_SCAN_DONE)
    {
      REG_SET_FIELD(RTC_CNTL_INT_ENA_REG,
                    RTC_CNTL_TOUCH_SCAN_DONE_INT_ENA,
                    true);
    }

  if (int_mask & TOUCH_INTR_MASK_TIMEOUT)
    {
      REG_SET_FIELD(RTC_CNTL_INT_ENA_REG,
                    RTC_CNTL_TOUCH_TIMEOUT_INT_ENA,
                    true);
    }
}

/****************************************************************************
 * Name: touch_lh_intr_disable
 *
 * Description:
 *   Disable touch sensor interrupt by bitmask.
 *
 * Input Parameters:
 *   int_mask - enum touch_pad_intr_mask_e interrupt type.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_intr_disable(enum touch_intr_mask_e int_mask)
{
  if (int_mask & TOUCH_INTR_MASK_DONE)
    {
      REG_SET_FIELD(RTC_CNTL_INT_ENA_REG,
                    RTC_CNTL_TOUCH_DONE_INT_ENA,
                    false);
    }

