apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_touch_lowerhalf.h
  prox_pad[2] = REG_GET_FIELD(SENS_SAR_TOUCH_CONF_REG,
                              SENS_TOUCH_APPROACH_PAD2);
}

/****************************************************************************
 * Name: touch_lh_proximity_set_meas_times
 *
 * Description:
 *   Set cumulative measurement times for proximity pad.
 *
 * Input Parameters:
 *   level - The cumulative number of measurement cycles.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_proximity_set_meas_times(uint32_t times)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_APPROACH_REG,
                RTC_CNTL_TOUCH_APPROACH_MEAS_TIME,
                times);
}

/****************************************************************************
 * Name: touch_lh_proximity_get_meas_times
 *
 * Description:
 *   Get cumulative measurement times for proximity pad.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current cumulative number of measurement cycles.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_proximity_get_meas_times(void)
{
  return REG_GET_FIELD(RTC_CNTL_TOUCH_APPROACH_REG,
                       RTC_CNTL_TOUCH_APPROACH_MEAS_TIME);
}

/****************************************************************************
 * Name: touch_lh_proximity_read_meas_cnt
 *
 * Description:
 *   Read current cumulative measurement times for proximity pad.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   The number of measurement cycles for touch pad channel.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_proximity_read_meas_cnt(enum touch_pad_e tp)
{
  if (REG_GET_FIELD(SENS_SAR_TOUCH_CONF_REG, SENS_TOUCH_APPROACH_PAD0) == tp)
    {
      return REG_GET_FIELD(SENS_SAR_TOUCH_APPR_STATUS_REG,
                           SENS_TOUCH_APPROACH_PAD0_CNT);
    }
  else if (REG_GET_FIELD(SENS_SAR_TOUCH_CONF_REG,
           SENS_TOUCH_APPROACH_PAD1) == tp)
    {
      return REG_GET_FIELD(SENS_SAR_TOUCH_APPR_STATUS_REG,
                           SENS_TOUCH_APPROACH_PAD1_CNT);
    }
  else if (REG_GET_FIELD(SENS_SAR_TOUCH_CONF_REG,
           SENS_TOUCH_APPROACH_PAD2) == tp)
    {
      return REG_GET_FIELD(SENS_SAR_TOUCH_APPR_STATUS_REG,
                           SENS_TOUCH_APPROACH_PAD2_CNT);
    }

  return 0;
}

/****************************************************************************
 * Name: touch_lh_proximity_pad_check
 *
 * Description:
 *   Check if the touch sensor channel is the proximity pad.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   True if yes or false if no.
 *
 ****************************************************************************/

static inline bool touch_lh_proximity_pad_check(enum touch_pad_e tp)
{
  if ((REG_GET_FIELD(SENS_SAR_TOUCH_CONF_REG,
       SENS_TOUCH_APPROACH_PAD0) != tp) &&
      (REG_GET_FIELD(SENS_SAR_TOUCH_CONF_REG,
       SENS_TOUCH_APPROACH_PAD1) != tp) &&
      (REG_GET_FIELD(SENS_SAR_TOUCH_CONF_REG,
       SENS_TOUCH_APPROACH_PAD2) != tp))
    {
      return false;
    }
  else
    {
      return true;
    }
}

/****************************************************************************
 * Name: touch_lh_sleep_set_channel_num
 *
 * Description:
 *   Set touch channel number for sleep pad.
 *   Only one touch sensor channel is supported in deep sleep mode.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_sleep_set_channel_num(enum touch_pad_e tp)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_SLP_THRES_REG,
                RTC_CNTL_TOUCH_SLP_PAD,
                tp);
}

/****************************************************************************
 * Name: touch_lh_sleep_get_channel_num
 *
 * Description:
 *   Get touch channel number for sleep pad.
 *   Only one touch sensor channel is supported in deep sleep mode.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current enum touch_pad_e channel.
 *
 ****************************************************************************/

static inline enum touch_pad_e touch_lh_sleep_get_channel_num(void)
{
  return (enum touch_pad_e)
    REG_GET_FIELD(RTC_CNTL_TOUCH_SLP_THRES_REG, RTC_CNTL_TOUCH_SLP_PAD);
}

/****************************************************************************
 * Name: touch_lh_sleep_set_threshold
 *
 * Description:
 *   Set the trigger threshold of touch sensor in deep sleep.
 *   The threshold determines the sensitivity of the touch sensor.
 *   The threshold is the original value of the trigger state minus the
 *   benchmark value.
 *   In general, the touch threshold during sleep can use the threshold
 *   parameter parameters before sleep.
 *
 * Input Parameters:
 *   touch_thres - The sleep threshold value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_sleep_set_threshold(uint32_t touch_thres)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_SLP_THRES_REG,
                RTC_CNTL_TOUCH_SLP_TH,
                touch_thres);
}

/****************************************************************************
 * Name: touch_lh_sleep_get_threshold
 *
 * Description:
 *   Get the trigger threshold of touch sensor in deep sleep.
 *   The threshold determines the sensitivity of the touch sensor.
 *   The threshold is the original value of the trigger state minus the
 *   benchmark value.
 *   In general, the touch threshold during sleep can use the threshold
 *   parameter parameters before sleep.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current sleep threshold value.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_sleep_get_threshold(void)
{
  return REG_GET_FIELD(RTC_CNTL_TOUCH_SLP_THRES_REG, RTC_CNTL_TOUCH_SLP_TH);
}

/****************************************************************************
 * Name: touch_lh_sleep_enable_approach
 *
 * Description:
 *   Enable proximity function for sleep pad.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

