apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_touch_lowerhalf.h
static inline void touch_lh_sleep_enable_approach(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_SLP_THRES_REG,
                RTC_CNTL_TOUCH_SLP_APPROACH_EN,
                true);
}

/****************************************************************************
 * Name: touch_lh_sleep_disable_approach
 *
 * Description:
 *   Disable proximity function for sleep pad.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_sleep_disable_approach(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_SLP_THRES_REG,
                RTC_CNTL_TOUCH_SLP_APPROACH_EN,
                false);
}

/****************************************************************************
 * Name: touch_lh_sleep_get_approach_status
 *
 * Description:
 *   Get proximity function status for sleep pad.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current approach status.
 *
 ****************************************************************************/

static inline bool touch_lh_sleep_get_approach_status(void)
{
  return (bool) REG_GET_FIELD(RTC_CNTL_TOUCH_SLP_THRES_REG,
                              RTC_CNTL_TOUCH_SLP_APPROACH_EN);
}

/****************************************************************************
 * Name: touch_lh_sleep_read_benchmark
 *
 * Description:
 *   Read benchmark of touch sensor for sleep pad.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current sleep pad benchmark value.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_sleep_read_benchmark(void)
{
  REG_SET_FIELD(SENS_SAR_TOUCH_CONF_REG,
                SENS_TOUCH_DATA_SEL,
                TOUCH_LH_READ_BENCHMARK);

  return REG_GET_FIELD(SENS_SAR_TOUCH_SLP_STATUS_REG, SENS_TOUCH_SLP_DATA);
}

/****************************************************************************
 * Name: touch_lh_sleep_read_smooth
 *
 * Description:
 *   Read smooth value of touch sensor for sleep pad.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current sleep pad smooth value.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_sleep_read_smooth(void)
{
  REG_SET_FIELD(SENS_SAR_TOUCH_CONF_REG,
                SENS_TOUCH_DATA_SEL,
                TOUCH_LH_READ_SMOOTH);

  return REG_GET_FIELD(SENS_SAR_TOUCH_SLP_STATUS_REG, SENS_TOUCH_SLP_DATA);
}

/****************************************************************************
 * Name: touch_lh_sleep_read_data
 *
 * Description:
 *   Read raw value of touch sensor for sleep pad.
 *   Sleep pad raw data is not in SENS_SAR_TOUCH_SLP_STATUS_REG.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current sleep pad raw value.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_sleep_read_data(void)
{
  uint32_t tp = REG_GET_FIELD(RTC_CNTL_TOUCH_SLP_THRES_REG,
                              RTC_CNTL_TOUCH_SLP_PAD);

  REG_SET_FIELD(SENS_SAR_TOUCH_CONF_REG,
                SENS_TOUCH_DATA_SEL,
                TOUCH_LH_READ_RAW);

  /* All touch pads have the same position for the data bits.
   * We can use any SENS_TOUCH_PADN_DATA.
   */

  return REG_GET_FIELD(sens_touch_status_reg[tp - 1], SENS_TOUCH_PAD1_DATA);
}

/****************************************************************************
 * Name: touch_lh_sleep_reset_benchmark
 *
 * Description:
 *   Reset sleep benchmark.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_sleep_reset_benchmark(void)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_APPROACH_REG,
                RTC_CNTL_TOUCH_SLP_CHANNEL_CLR,
                true);
}

/****************************************************************************
 * Name: touch_lh_sleep_low_power
 *
 * Description:
 *   Select touch sensor dbias to save power in sleep mode.
 *
 * Input Parameters:
 *   is_low_power - True or false.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_sleep_low_power(bool is_low_power)
{
  REG_SET_FIELD(RTC_CNTL_TOUCH_CTRL2_REG,
                RTC_CNTL_TOUCH_DBIAS,
                is_low_power);
}

/****************************************************************************
 * Name: touch_lh_sleep_read_debounce
 *
 * Description:
 *   Read debounce of touch sensor for sleep pad.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current sleep pad debounce value.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_sleep_read_debounce(void)
{
  return REG_GET_FIELD(SENS_SAR_TOUCH_SLP_STATUS_REG,
                       SENS_TOUCH_SLP_DEBOUNCE);
}

/****************************************************************************
 * Name: touch_lh_sleep_read_proximity_cnt
 *
 * Description:
 *   Read proximity count of touch sensor for sleep pad.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current sleep pad proximity count.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_sleep_read_proximity_cnt(void)
{
  return REG_GET_FIELD(SENS_SAR_TOUCH_APPR_STATUS_REG,
                       SENS_TOUCH_SLP_APPROACH_CNT);
}

/****************************************************************************
 * Name: touch_lh_get_wakeup_status
 *
 * Description:
 *   Get the touch pad which caused wakeup from deep sleep.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The touch pad channel.
 *
 ****************************************************************************/

static inline enum touch_pad_e touch_lh_get_wakeup_status(void)
{
  return (enum touch_pad_e)
    REG_GET_FIELD(RTC_CNTL_TOUCH_SLP_THRES_REG,
                  RTC_CNTL_TOUCH_SLP_PAD);
}

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

#ifdef __cplusplus
}
#endif
#undef EXTERN

#endif /* __ASSEMBLY__ */
#endif /* __ARCH_XTENSA_SRC_ESP32S2_ESP32S2_TOUCH_LOWERHALF_H */
